Revit 2026 API

# ConcreteConcreteBumpMap Property

---

The property labeled "Image" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteBumpMap { get; }
```
```vb
Public Shared ReadOnly Property ConcreteBumpMap As String
	Get
```
```cpp
public:
static property String^ ConcreteBumpMap {
	String^ get ();
}
```
```fsharp
static member ConcreteBumpMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace